import "../components/Qcourse2.css";

function Qcourse2() {
  return (
    <div className="container-explanation1">
      <h1>
        مزایای استفاده از React در توسعه frontend چیست؟ برنامه های کاربردی؟
      </h1>
      <p>
        معماری مبتنی بر کامپوننت:{" "}
        <strong>React از معماری مبتنی بر کامپوننت پیروی می‌کند</strong> و به
        توسعه‌دهندگان این امکان را می‌دهد تا رابط‌های کاربری پیچیده‌ای را با
        تجزیه آنها به اجزای کوچک‌تر و قابل استفاده مجدد بسازند.
      </p>
      <p>
        <strong>
          {" "}
          Virtual DOM: React از یک DOM مجازی استفاده می کند که نمایش سبکی از DOM
        </strong>
        Virtual DOM: React از یک DOM مجازی استفاده می کند که نمایش سبکی از DOM
        واقعی است. هنگامی که تغییراتی در وضعیت برنامه ایجاد می شود، به طور موثر
        فقط اجزای لازم را به روز می کند و ارائه می دهد. این باعث بهبود عملکرد و
        تجربه کاربری روانتر می شود.
      </p>
      <p>
        <strong> جریان داده های یک طرفه: React</strong>
        یک جریان داده یک طرفه را اعمال می کند که به عنوان اتصال یک طرفه نیز
        شناخته می شود. این الگو درک و اشکال زدایی منطق برنامه را آسان تر می کند
        زیرا داده ها در یک جهت از مؤلفه های والد به مؤلفه های فرزند جریان می
        یابند.
      </p>
      <p>
        <strong>Declarative Syntax:</strong>
        سینتکس اعلامی: React از یک نحو اعلامی استفاده می‌کند، به این معنی که
        توسعه‌دهندگان توصیف می‌کنند که می‌خواهند رابط کاربری آن‌ها چه شکلی باشد،
        و React به‌روزرسانی DOM واقعی را بر این اساس انجام می‌دهد.
      </p>
      <p>
        <strong>اکوسیستم گسترده: React</strong>
        اکوسیستم گسترده: React دارای اکوسیستم وسیعی از کتابخانه ها، ابزارها و
        پشتیبانی جامعه است. می‌توانید کتابخانه‌هایی مانند React Router برای
        مسیریابی، Redux برای مدیریت حالت و Axios برای رسیدگی به درخواست‌های HTTP
        پیدا کنید.دارای اکوسیستم وسیعی از کتابخانه ها، ابزارها و پشتیبانی جامعه
        است. می‌توانید کتابخانه‌هایی مانند React Router برای مسیریابی، Redux
        برای مدیریت حالت و Axios برای رسیدگی به درخواست‌های HTTP پیدا کنید.
      </p>
    </div>
  );
}
export default Qcourse2;
